app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "online", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "SQL basics"], ["online", 1], ["price", 19900.0], ["created_at", "2018-12-16 13:29:30.640146"], ["updated_at", "2018-12-16 13:29:30.640146"]]
---
  def create
    @course = Course.new(name: params[:course][:name], price: params[:course][:price], online: params[:course][:online])
    @course.save

UPDATE "courses" SET "price" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["price", 1000.0], ["updated_at", "2018-12-16 19:14:47.112482"], ["id", 12]]
---
  def update
    @course = Course.update(params[:id], name: params[:course][:name], price: params[:course][:price], online: params[:course][:online])

DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 10]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def destroy
    Course.find(params[:id]).destroy